import React from "react";
import "./Rules.css"
import Back from "./Back";

const Rules = () => {
    return (
        <div className="container">
            <h1 className="heading">Правила гри "Морський бій"</h1>
            <p className="paragraph">Гра "Морський бій" - це стратегічна гра для двох гравців, яка полягає в тому, щоб першим знищити всі кораблі противника.</p>
            
            <h2 className="subHeading">Підготовка до гри</h2>
            <ul className="list">
                <li>Кожен гравець отримує ігрове поле розміром 10x10 клітинок.</li>
                <li>Гравці розміщають свої кораблі на своєму полі. Кожен корабель має певну кількість клітинок і розташовується горизонтально або вертикально.</li>
                <li>Кораблі не можуть торкатися один одного, але можуть займати сусідні клітинки.</li>
            </ul>
            
            <h2 className="subHeading">Правила гри</h2>
            <ul className="list">
                <li>Гравці чергуються пострілами на полі противника, намагаючись потопити його кораблі.</li>
                <li>Гравець обирає клітинку на полі противника і стріляє в неї.</li>
                <li>Якщо стрілець попав, він отримує ще один хід.</li>
                <li>Якщо стрілець промахнувся, хід переходить до іншого гравця.</li>
                <li>Переможцем вважається гравець, який першим знищив всі кораблі противника.</li>
            </ul>

            <h2 className="subHeading">Типи кораблів</h2>
            <ul className="list">
                <li>Корабель "Лінкор" - 4 клітинки.</li>
                <li>Крейсер - 3 клітинки.</li>
                <li>Эсмінець - 2 клітинки.</li>
                <li>Катер - 1 клітинка.</li>
            </ul>
            <Back />
        </div>
    );
}

export default Rules;

