import React from "react";

const Rules = () => {
    return (
        <div style={{ maxWidth: "800px", margin: "0 auto", padding: "20px" }}>
            <h1>Правила гри "Морський бій"</h1>
            <p>Гра "Морський бій" - це стратегічна гра для двох гравців, яка полягає в тому, щоб першим знищити всі кораблі противника.</p>
            
            <h2>Підготовка до гри</h2>
            <ul>
                <li>Кожен гравець отримує ігрове поле розміром 10x10 клітинок.</li>
                <li>Гравці розміщають свої кораблі на своєму полі. Кожен корабель має певну кількість клітинок і розташовується горизонтально або вертикально.</li>
                <li>Кораблі не можуть торкатися один одного, але можуть займати сусідні клітинки.</li>
            </ul>
            
            <h2>Правила гри</h2>
            <ul>
                <li>Гравці чергуються пострілами на полі противника, намагаючись потопити його кораблі.</li>
                <li>Гравець обирає клітинку на полі противника і стріляє в неї.</li>
                <li>Якщо стрілець попав, він отримує ще один хід.</li>
                <li>Якщо стрілець промахнувся, хід переходить до іншого гравця.</li>
                <li>Переможцем вважається гравець, який першим знищив всі кораблі противника.</li>
            </ul>

            <h2>Типи кораблів</h2>
            <ul>
                <li>Корабель "Лінкор" - 4 клітинки.</li>
                <li>Крейсер - 3 клітинки.</li>
                <li>Эсмінець - 2 клітинки.</li>
                <li>Катер - 1 клітинка.</li>
            </ul>
        </div>
    );
}

export default Rules;
